Hi @murakest 

```
# cat main.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1" 
}

resource "fortios_firewall_policy" "myrule" {
    action                      = "accept"
    anti_replay                 = "enable"
    auth_path                   = "disable"
    auto_asic_offload           = "enable"
    av_profile                  = "wifi-default"
    inspection_mode             = "flow"
    internet_service            = "enable"
    ips_sensor                  = "protect_email_server"
    logtraffic                  = "utm"
    name                        = "rule1"
    policyid                    = 1
    schedule                    = "always"
    ssl_ssh_profile             = "certificate-inspection"
    status                      = "enable"
    utm_status                  = "enable"

    dstintf {
        name = "port1"
    }

    internet_service_name {
        name = "Amazon-AWS"
    }
    internet_service_name {
        name = "GitHub-GitHub"
    }

    srcaddr {
        name = "FABRIC_DEVICE"
    }

    srcintf {
        name = "port2"
    }
}

# terraform apply
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_policy.myrule will be created
  + resource "fortios_firewall_policy" "myrule" {
      + action                      = "accept"
      + anti_replay                 = "enable"
      + application_list            = (known after apply)
      + auth_cert                   = (known after apply)
      + auth_path                   = "disable"
      + auth_redirect_addr          = (known after apply)
      + auto_asic_offload           = "enable"
      + av_profile                  = "wifi-default"
      + block_notification          = (known after apply)
      + captive_portal_exempt       = (known after apply)
      + capture_packet              = (known after apply)
      + cifs_profile                = (known after apply)
      + delay_tcp_npu_session       = (known after apply)
      + diffserv_forward            = (known after apply)
      + diffserv_reverse            = (known after apply)
      + diffservcode_forward        = (known after apply)
      + diffservcode_rev            = (known after apply)
      + disclaimer                  = (known after apply)
      + dlp_sensor                  = (known after apply)
      + dnsfilter_profile           = (known after apply)
      + dsri                        = (known after apply)
      + dstaddr_negate              = (known after apply)
      + email_collect               = (known after apply)
      + emailfilter_profile         = (known after apply)
      + firewall_session_dirty      = (known after apply)
      + fixedport                   = (known after apply)
      + fsso                        = (known after apply)
      + fsso_agent_for_ntlm         = (known after apply)
      + geoip_anycast               = (known after apply)
      + global_label                = (known after apply)
      + http_policy_redirect        = (known after apply)
      + icap_profile                = (known after apply)
      + id                          = (known after apply)
      + identity_based_route        = (known after apply)
      + inbound                     = (known after apply)
      + inspection_mode             = "flow"
      + internet_service            = "enable"
      + internet_service_negate     = (known after apply)
      + internet_service_src        = (known after apply)
      + internet_service_src_negate = (known after apply)
      + ippool                      = (known after apply)
      + ips_sensor                  = "protect_email_server"
      + label                       = (known after apply)
      + learning_mode               = (known after apply)
      + logtraffic                  = "utm"
      + logtraffic_start            = (known after apply)
      + match_vip                   = (known after apply)
      + match_vip_only              = (known after apply)
      + name                        = "rule1"
      + nat                         = (known after apply)
      + natinbound                  = (known after apply)
      + natip                       = (known after apply)
      + natoutbound                 = (known after apply)
      + ntlm                        = (known after apply)
      + ntlm_guest                  = (known after apply)
      + outbound                    = (known after apply)
      + per_ip_shaper               = (known after apply)
      + permit_any_host             = (known after apply)
      + permit_stun_host            = (known after apply)
      + policyid                    = 1
      + profile_group               = (known after apply)
      + profile_protocol_options    = (known after apply)
      + profile_type                = (known after apply)
      + radius_mac_auth_bypass      = (known after apply)
      + redirect_url                = (known after apply)
      + replacemsg_override_group   = (known after apply)
      + reputation_direction        = (known after apply)
      + reputation_minimum          = (known after apply)
      + rsso                        = (known after apply)
      + rtp_nat                     = (known after apply)
      + scan_botnet_connections     = (known after apply)
      + schedule                    = "always"
      + schedule_timeout            = (known after apply)
      + send_deny_packet            = (known after apply)
      + service_negate              = (known after apply)
      + session_ttl                 = (known after apply)
      + spamfilter_profile          = (known after apply)
      + srcaddr_negate              = (known after apply)
      + ssh_filter_profile          = (known after apply)
      + ssh_policy_redirect         = (known after apply)
      + ssl_mirror                  = (known after apply)
      + ssl_ssh_profile             = "certificate-inspection"
      + status                      = "enable"
      + tcp_mss_receiver            = (known after apply)
      + tcp_mss_sender              = (known after apply)
      + tcp_session_without_syn     = (known after apply)
      + timeout_send_rst            = (known after apply)
      + tos                         = (known after apply)
      + tos_mask                    = (known after apply)
      + tos_negate                  = (known after apply)
      + traffic_shaper              = (known after apply)
      + traffic_shaper_reverse      = (known after apply)
      + utm_status                  = "enable"
      + uuid                        = (known after apply)
      + vlan_cos_fwd                = (known after apply)
      + vlan_cos_rev                = (known after apply)
      + vlan_filter                 = (known after apply)
      + voip_profile                = (known after apply)
      + vpntunnel                   = (known after apply)
      + waf_profile                 = (known after apply)
      + wanopt                      = (known after apply)
      + wanopt_detection            = (known after apply)
      + wanopt_passive_opt          = (known after apply)
      + wanopt_peer                 = (known after apply)
      + wanopt_profile              = (known after apply)
      + wccp                        = (known after apply)
      + webcache                    = (known after apply)
      + webcache_https              = (known after apply)
      + webfilter_profile           = (known after apply)
      + webproxy_forward_server     = (known after apply)
      + webproxy_profile            = (known after apply)
      + wsso                        = (known after apply)

      + dstintf {
          + name = "port1"
        }

      + internet_service_name {
          + name = "Amazon-AWS"
        }
      + internet_service_name {
          + name = "GitHub-GitHub"
        }

      + srcaddr {
          + name = "FABRIC_DEVICE"
        }

      + srcintf {
          + name = "port2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_policy.myrule: Creating...
fortios_firewall_policy.myrule: Creation complete after 0s [id=1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.


```

**Results(FortiOS 6.4.4):**

![1](https://user-images.githubusercontent.com/49291382/103671331-bb00d180-4fb5-11eb-86b6-d70e71702b7e.png)
Does this make sense? Thank you!
